{
    "hardware_assets.dependency_metrics": {
      "hardware_id": "HW001",
      "company_id": "COMP12345",
      "reporting_period": "2025-10",
      "variables": {
        "revenue_share": {
          "definition": "Proportion of the company’s monthly revenue processed or enabled by this hardware (0–1). Measures direct financial exposure to its failure.",
          "example": 0.25,
          "notes": "Derived from billing, ERP, or transaction routing data. For example, if services relying on this hardware generate $25M of a $100M monthly revenue, then revenue_share = 0.25."
        },
        "critical_service_share": {
          "definition": "Fraction of the company’s critical services that depend on this hardware (0–1). Reflects how many mission-critical functions would be impaired.",
          "example": 0.4,
          "notes": "From service catalog or business continuity registry. If 4 of 10 critical services rely on this hardware, then critical_service_share = 0.4."
        },
        "client_share": {
          "definition": "Fraction of clients directly dependent on this hardware’s services (0–1). Indicates the breadth of customer impact.",
          "example": 0.3,
          "notes": "Estimated from CRM or SLA data. If 300 of 1000 active clients would lose service access during a failure, client_share = 0.3."
        },
        "capacity_share": {
          "definition": "Proportion of the company’s total technical or operational capacity that depends on this hardware (0–1). Captures how much of the firm’s total workload or production runs through this system.",
          "example": 0.35,
          "notes": "Represents the share of total compute, storage, or network throughput this hardware supports. Example: if this server hosts 35% of compute cores or handles 35% of total transaction volume, capacity_share = 0.35.",
          "interpretation": "High capacity_share = large operational impact if it fails; low capacity_share = limited disruption."
        },
        "redundancy_level": {
          "definition": "Fraction (0–1) of this hardware’s function that can be immediately covered by redundant or backup systems. Reflects resilience and failover readiness.",
          "example": 0.5,
          "notes": "Derived from disaster recovery or load-balancing plans. Example: if backup systems can handle 50% of load instantly, redundancy_level = 0.5; if fully mirrored (100%), redundancy_level = 1.0; if no backup, redundancy_level = 0.0.",
          "interpretation": "High redundancy_level reduces operational reliance; a system with perfect failover (1.0) contributes almost no dependency risk."
        }
      },
      "computed_metric": {
        "name": "operational_reliance",
        "definition": "Composite score (0–1) measuring the company’s dependency on this hardware for critical operations. Computed by the regulator from the above fields.",
        "formula": "operational_reliance = (weighted_sum of shares) × (1 − redundancy_level)",
        "interpretation": "1 = company fully dependent on this hardware (no backup, high exposure). 0 = no operational dependence (fully redundant, negligible load)."
      },
      "timestamps": {
        "submission": "2025-10-28T10:00:00Z",
        "last_updated": "2025-10-28T10:00:00Z"
      }
    }
  }
  
